doc/byoasp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-16 Tue 18:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Little Adventures in Wizard Programming</title>
<meta name="author" content="lascauje" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./export/config/org.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Little Adventures in Wizard Programming</h1>
