doc/byoasp.html
<div id="outline-container-org87b924b" class="outline-3">
<h3 id="org87b924b">Documentation Generation</h3>
<div class="outline-text-3" id="text-org87b924b">
<p>
Generates this <code>HTML</code> documentation.
</p>
<div class="org-src-container">
<pre class="src src-bash">emacs byoasp.org --batch --eval <span class="org-sh-escaped-newline">\</span>
<span class="org-string">"(progn (require 'org)</span>
<span class="org-string">        (setq org-html-htmlize-output-type 'css)</span>
<span class="org-string">        (setq org-html-postamble \"Made with &amp;#x3BB; by %a and powered by %c.\")</span>
<span class="org-string">        (org-html-export-to-html))"</span>
</pre>
</div>
</div>
</div>
