byoasp.org
** References
- Konrad Hinsen. 2020. [[https://guix.gnu.org/en/blog/2020/reproducible-computations-with-guix/][Reproducible computations with Guix]]
- Donald E. Knuth. 1992. [[https://www-cs-faculty.stanford.edu/~knuth/lp.html][Literate Programming]]
* Automatic Differentiation, Symbolic Programming
Special historical significance in Lisp.
** Newton's Method
A root-finding algorithm, defined as

\begin{align*}
x_{n+1}=x_{n}-{\frac {f(x_{n})}{f'(x_{n})}}
\end{align*}
#+NAME: src-newton-method-definition
#+BEGIN_SRC scheme
  (define (close-enough? x y tolerance) (< (abs (- x y)) tolerance))

  (define (root-newton expr var initial-guess tolerance)
    ;; Hack around to define new functions from data!
    (let* ((f (eval `(lambda (,var) ,expr)
                    (interaction-environment)))
           (Df (eval `(lambda (,var) ,(derivative expr var))
                     (interaction-environment))))
      (define (improve-guess xn)
        (- xn (/ (f xn) (Df xn))))
      (let loop ((xn initial-guess))
        (let ((xn+1 (improve-guess xn)))
          (if (close-enough? xn xn+1 tolerance)
              xn+1
              (loop xn+1))))))
#+END_SRC

Let $\cos\theta=\sin\theta$, how to find the angle $\theta$?
#+NAME: src-newton-method-example
#+BEGIN_SRC scheme
  (root-newton '(- (cos theta) (sin theta)) 'theta 0.5 1e-8)
  ;; .7853981633974484
#+END_SRC
** Taylor Series
Approximation of a differentiable function, around a given point, by a
polynomial.

\begin{align*}
f(x)=f(a)+{\frac {f'(a)}{1!}}\,(x-a)+{\frac {f^{(2)}(a)}{2!}}\,(x-a)^{2}+\cdots +{\frac {f^{(n)}(a)}{n!}}\,(x-a)^{n}+R_{n}(x)
\end{align*}

In the more compact sigma notation
\begin{align*}
f(x)=\sum _{k=0}^{n}{\frac {f^{(k)}(a)}{k!}}\,(x-a)^{k}+R_{n}(x)
\end{align*}
#+NAME: src-taylor-series-definition
#+BEGIN_SRC scheme
  (define (factorial n)
    (define (factlp count answer)
      (if (> count n)
          answer
          (factlp (+ count 1) (* count answer))))
    (factlp 1 1))

  (define (derivative-n expr var n)
    (define (derivlp count answer)
      (if (> count n)
          answer
          (derivlp (+ count 1) (derivative answer var))))
    (derivlp 1 expr))

  (define (taylor-c k func a var)
    `(* (/ ,(derivative-n func a k) ,(factorial k)) (expt (- ,var ,a) ,k)))

  (define (taylor-s n func a var)
    (define (taylorlp count answer)
      (if (> count n)
          answer
          (taylorlp (+ count 1)
                    (append answer (list (taylor-c count func a var))))))
    (taylorlp 1 `(+ (Rn ,var) ,func)))
#+END_SRC

The polynomial of degree five for $e^{a}$ is
#+NAME: src-taylor-series-example
#+BEGIN_SRC scheme
  (taylor-s 5 '(exp a) 'a 'x)
  ;; '(+ (Rn x)
  ;;     (exp a)
  ;;     (* (/ (* 1 (exp a)) 1) (expt (- x a) 1))
  ;;     (* (/ (* 1 (exp a)) 2) (expt (- x a) 2))
  ;;     (* (/ (* 1 (exp a)) 6) (expt (- x a) 3))
  ;;     (* (/ (* 1 (exp a)) 24) (expt (- x a) 4))
  ;;     (* (/ (* 1 (exp a)) 120) (expt (- x a) 5)))
#+END_SRC
