doc/byoasp.html

<div id="outline-container-orgc58b063" class="outline-3">
<h3 id="orgc58b063">References</h3>
<div class="outline-text-3" id="text-orgc58b063">
<ul class="org-ul">
<li>Konrad Hinsen. 2020. <a href="https://guix.gnu.org/en/blog/2020/reproducible-computations-with-guix/">Reproducible computations with Guix</a></li>
<li>Donald E. Knuth. 1992. <a href="https://www-cs-faculty.stanford.edu/~knuth/lp.html">Literate Programming</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgec425e0" class="outline-2">
<h2 id="orgec425e0">Automatic Differentiation, Symbolic Programming</h2>
<div class="outline-text-2" id="text-orgec425e0">
<p>
Special historical significance in Lisp.
</p>
</div>
<div id="outline-container-org23a9d1b" class="outline-3">
<h3 id="org23a9d1b">Newton's Method</h3>
<div class="outline-text-3" id="text-org23a9d1b">
<p>
A root-finding algorithm, defined as
</p>

\begin{align*}
x_{n+1}=x_{n}-{\frac {f(x_{n})}{f'(x_{n})}}
\end{align*}
<div class="org-src-container">
<pre class="src src-scheme" id="org1b7699c">(<span class="org-keyword">define</span> (<span class="org-function-name">close-enough?</span> x y tolerance) (&lt; (abs (- x y)) tolerance))

(<span class="org-keyword">define</span> (<span class="org-function-name">root-newton</span> expr var initial-guess tolerance)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Hack around to define new functions from data!</span>
  (<span class="org-keyword">let*</span> ((f (eval `(<span class="org-keyword">lambda</span> (,var) ,expr)
                  (interaction-environment)))
         (Df (eval `(<span class="org-keyword">lambda</span> (,var) ,(derivative expr var))
                   (interaction-environment))))
    (<span class="org-keyword">define</span> (<span class="org-function-name">improve-guess</span> xn)
      (- xn (/ (f xn) (Df xn))))
    (<span class="org-keyword">let</span> <span class="org-function-name">loop</span> ((xn initial-guess))
      (<span class="org-keyword">let</span> ((xn+1 (improve-guess xn)))
        (<span class="org-keyword">if</span> (close-enough? xn xn+1 tolerance)
            xn+1
            (loop xn+1))))))
</pre>
</div>

<p>
Let \(\cos\theta=\sin\theta\), how to find the angle \(\theta\)?
</p>
<div class="org-src-container">
<pre class="src src-scheme" id="org9b363f6">(root-newton '(- (cos theta) (sin theta)) 'theta 0.5 1e-8)
<span class="org-comment-delimiter">;; </span><span class="org-comment">.7853981633974484</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1f3bde7" class="outline-3">
<h3 id="org1f3bde7">Taylor Series</h3>
<div class="outline-text-3" id="text-org1f3bde7">
<p>
Approximation of a differentiable function, around a given point, by a
polynomial.
</p>

\begin{align*}
f(x)=f(a)+{\frac {f'(a)}{1!}}\,(x-a)+{\frac {f^{(2)}(a)}{2!}}\,(x-a)^{2}+\cdots +{\frac {f^{(n)}(a)}{n!}}\,(x-a)^{n}+R_{n}(x)
\end{align*}

<p>
In the more compact sigma notation
</p>
\begin{align*}
f(x)=\sum _{k=0}^{n}{\frac {f^{(k)}(a)}{k!}}\,(x-a)^{k}+R_{n}(x)
\end{align*}
<div class="org-src-container">
<pre class="src src-scheme" id="org64c32e8">(<span class="org-keyword">define</span> (<span class="org-function-name">factorial</span> n)
  (<span class="org-keyword">define</span> (<span class="org-function-name">factlp</span> count answer)
    (<span class="org-keyword">if</span> (&gt; count n)
        answer
        (factlp (+ count 1) (* count answer))))
  (factlp 1 1))

(<span class="org-keyword">define</span> (<span class="org-function-name">derivative-n</span> expr var n)
  (<span class="org-keyword">define</span> (<span class="org-function-name">derivlp</span> count answer)
    (<span class="org-keyword">if</span> (&gt; count n)
        answer
        (derivlp (+ count 1) (derivative answer var))))
  (derivlp 1 expr))

(<span class="org-keyword">define</span> (<span class="org-function-name">taylor-c</span> k func a var)
  `(* (/ ,(derivative-n func a k) ,(factorial k)) (expt (- ,var ,a) ,k)))

(<span class="org-keyword">define</span> (<span class="org-function-name">taylor-s</span> n func a var)
  (<span class="org-keyword">define</span> (<span class="org-function-name">taylorlp</span> count answer)
    (<span class="org-keyword">if</span> (&gt; count n)
        answer
        (taylorlp (+ count 1)
                  (append answer (list (taylor-c count func a var))))))
  (taylorlp 1 `(+ (Rn ,var) ,func)))
</pre>
</div>

<p>
The polynomial of degree five for \(e^{a}\) is
</p>
<div class="org-src-container">
<pre class="src src-scheme" id="orgeec0ee7">(taylor-s 5 '(exp a) 'a 'x)
<span class="org-comment-delimiter">;; </span><span class="org-comment">'(+ (Rn x)</span>
<span class="org-comment-delimiter">;;     </span><span class="org-comment">(exp a)</span>
<span class="org-comment-delimiter">;;     </span><span class="org-comment">(* (/ (* 1 (exp a)) 1) (expt (- x a) 1))</span>
<span class="org-comment-delimiter">;;     </span><span class="org-comment">(* (/ (* 1 (exp a)) 2) (expt (- x a) 2))</span>
<span class="org-comment-delimiter">;;     </span><span class="org-comment">(* (/ (* 1 (exp a)) 6) (expt (- x a) 3))</span>
<span class="org-comment-delimiter">;;     </span><span class="org-comment">(* (/ (* 1 (exp a)) 24) (expt (- x a) 4))</span>
<span class="org-comment-delimiter">;;     </span><span class="org-comment">(* (/ (* 1 (exp a)) 120) (expt (- x a) 5)))</span>
</pre>
</div>
</div>
</div>
