byoasp.org
** Differentiation Source Code
#+NAME: src-differentiation-definition
#+BEGIN_SRC scheme
  ;; Hack around to avoid "warning: possibly unbound"
  (define derivative '())

  ;;;; Define predicates

  (define (=number? expr num) (and (number? expr) (= expr num)))

  (define (variable? x) (symbol? x))

  (define (same-variable? v1 v2)
    (and (variable? v1) (variable? v2) (eq? v1 v2)))

  (define (func? f expr) (eq? f (car expr)))

  (define (sum? x) (and (pair? x) (eq? (car x) '+)))

  (define (sub? x) (and (pair? x) (eq? (car x) '-)))

  (define (product? x) (and (pair? x) (eq? (car x) '*)))

  (define (quotient? x) (and (pair? x) (eq? (car x) '/)))

  ;;;; Define helper functions

  (define (addend s) (cadr s))

  (define (augend s) (caddr s))

  (define (multiplier p) (cadr p))

  (define (multiplicand p) (caddr p))

  (define (make-sum a1 a2)
    (cond ((=number? a1 0) a2)
          ((=number? a2 0) a1)
          ((and (number? a1) (number? a2)) (+ a1 a2))
          (else (list '+ a1 a2))))

  (define (make-sub a1 a2)
    (cond ((=number? a1 0) (- a2))
          ((=number? a2 0) a1)
          ((and (number? a1) (number? a2)) (- a1 a2))
          (else (list '- a1 a2))))

  (define (make-product m1 m2)
    (cond ((or (=number? m1 0) (=number? m2 0)) 0)
          ((=number? m1 1) m2)
          ((=number? m2 1) m1)
          ((and (number? m1) (number? m2)) (* m1 m2))
          (else (list '* m1 m2))))

  (define (make-quotient m1 m2)
    (cond ((=number? m2 0) +inf.0)
          ((=number? m2 1) m1)
          ((=number? m1 0) 0)
          ((and (number? m1) (number? m2)) (/ m1 m2))
          (else (list '/ m1 m2))))

  ;; [u^n]' == u'*(n*u^(n-1))
  ;; expr == (expt u n)
  (define (deriv-expt expr var)
    (let ((v (derivative (cadr expr) var)))
      (if (=number? v 0)
          0
          `(* ,v (* n (expt ,(cadr expr) (- ,(caddr expr) 1)))))))

  ;; [sqrt(u)]' == u'/(2*sqrt(u))
  ;; expr == (sqrt 2)
  (define (deriv-sqrt expr var)
    (let ((v (derivative (cadr expr) var)))
      (if (=number? v 0)
          0
          `(/ ,v (* 2 (sqrt ,(cadr expr)))))))

  ;; [exp(u)]' == u'exp(u)
  ;; expr == (exp u)
  (define (deriv-exp expr var)
    (let ((v (derivative (cadr expr) var)))
      (if (=number? v 0)
          0
          `(* ,v (exp ,(cadr expr))))))

  ;; [log(u)]' == u'/log(u)
  ;; expr == (log u)
  (define (deriv-log expr var)
    (let ((v (derivative (cadr expr) var)))
      (if (=number? v 0)
          0
          `(/ ,v ,(cadr expr)))))

  ;; [cos(u)]' == u'cos(u)
  ;; expr == (cos u)
  (define (deriv-sin expr var)
    (let ((v (derivative (cadr expr) var)))
      (cond ((=number? v 0) 0)
            ((=number? v 1) `(cos ,(cadr expr)))
            (else `(* ,v (cos ,(cadr expr)))))))

  ;; [sin(u)]' == -u'sin(u)
  ;; expr == (sin u)
  (define (deriv-cos expr var)
    (let ((v (derivative (cadr expr) var)))
      (cond ((=number? v 0) 0)
            ((=number? v 1) `(- (sin ,(cadr expr))))
            (else `(* ,v (- (sin ,(cadr expr))))))))

  ;; Entry point
  (define (derivative expr var)
    (cond ((number? expr) 0)
          ((variable? expr) (if (same-variable? expr var) 1 0))
          ((sum? expr) (make-sum (derivative (addend expr) var)
                                 (derivative (augend expr) var)))
          ((sub? expr) (make-sub (derivative (addend expr) var)
                                 (derivative (augend expr) var)))
          ((product? expr)
           (make-sum
            (make-product (multiplier expr)
                          (derivative (multiplicand expr) var))
            (make-product (derivative (multiplier expr) var)
                          (multiplicand expr))))
          ((quotient? expr)
           (make-quotient
            (make-sub
             (make-product (derivative (multiplier expr) var)
                           (multiplicand expr))

             (make-product (multiplier expr)
                           (derivative (multiplicand expr) var)))
            (make-product
             (multiplicand expr)
             (multiplicand expr))))
          ((func? 'expt expr) (deriv-expt expr var))
          ((func? 'sqrt expr) (deriv-sqrt expr var))
          ((func? 'exp expr) (deriv-exp expr var))
          ((func? 'log expr) (deriv-log expr var))
          ((func? 'sin expr) (deriv-sin expr var))
          ((func? 'cos expr) (deriv-cos expr var))
          (else
           (error "unknown expression type: DERIV" expr))))
#+END_SRC
