doc/byoasp.html
<div id="outline-container-org3f8ad8c" class="outline-3">
<h3 id="org3f8ad8c">Differentiation Source Code</h3>
<div class="outline-text-3" id="text-org3f8ad8c">
<div class="org-src-container">
<pre class="src src-scheme" id="org136e82f"><span class="org-comment-delimiter">;; </span><span class="org-comment">Hack around to avoid "warning: possibly unbound"</span>
(<span class="org-keyword">define</span> <span class="org-function-name">derivative</span> '())

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">Define predicates</span>

(<span class="org-keyword">define</span> (<span class="org-function-name">=number?</span> expr num) (<span class="org-keyword">and</span> (number? expr) (= expr num)))

(<span class="org-keyword">define</span> (<span class="org-function-name">variable?</span> x) (symbol? x))

(<span class="org-keyword">define</span> (<span class="org-function-name">same-variable?</span> v1 v2)
  (<span class="org-keyword">and</span> (variable? v1) (variable? v2) (eq? v1 v2)))

(<span class="org-keyword">define</span> (<span class="org-function-name">func?</span> f expr) (eq? f (car expr)))

(<span class="org-keyword">define</span> (<span class="org-function-name">sum?</span> x) (<span class="org-keyword">and</span> (pair? x) (eq? (car x) '+)))

(<span class="org-keyword">define</span> (<span class="org-function-name">sub?</span> x) (<span class="org-keyword">and</span> (pair? x) (eq? (car x) '-)))

(<span class="org-keyword">define</span> (<span class="org-function-name">product?</span> x) (<span class="org-keyword">and</span> (pair? x) (eq? (car x) '*)))

(<span class="org-keyword">define</span> (<span class="org-function-name">quotient?</span> x) (<span class="org-keyword">and</span> (pair? x) (eq? (car x) '/)))

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">Define helper functions</span>

(<span class="org-keyword">define</span> (<span class="org-function-name">addend</span> s) (cadr s))

(<span class="org-keyword">define</span> (<span class="org-function-name">augend</span> s) (caddr s))

(<span class="org-keyword">define</span> (<span class="org-function-name">multiplier</span> p) (cadr p))

(<span class="org-keyword">define</span> (<span class="org-function-name">multiplicand</span> p) (caddr p))

(<span class="org-keyword">define</span> (<span class="org-function-name">make-sum</span> a1 a2)
  (<span class="org-keyword">cond</span> ((=number? a1 0) a2)
        ((=number? a2 0) a1)
        ((<span class="org-keyword">and</span> (number? a1) (number? a2)) (+ a1 a2))
        (<span class="org-keyword">else</span> (list '+ a1 a2))))

(<span class="org-keyword">define</span> (<span class="org-function-name">make-sub</span> a1 a2)
  (<span class="org-keyword">cond</span> ((=number? a1 0) (- a2))
        ((=number? a2 0) a1)
        ((<span class="org-keyword">and</span> (number? a1) (number? a2)) (- a1 a2))
        (<span class="org-keyword">else</span> (list '- a1 a2))))

(<span class="org-keyword">define</span> (<span class="org-function-name">make-product</span> m1 m2)
  (<span class="org-keyword">cond</span> ((<span class="org-keyword">or</span> (=number? m1 0) (=number? m2 0)) 0)
        ((=number? m1 1) m2)
        ((=number? m2 1) m1)
        ((<span class="org-keyword">and</span> (number? m1) (number? m2)) (* m1 m2))
        (<span class="org-keyword">else</span> (list '* m1 m2))))

(<span class="org-keyword">define</span> (<span class="org-function-name">make-quotient</span> m1 m2)
  (<span class="org-keyword">cond</span> ((=number? m2 0) +inf.0)
        ((=number? m2 1) m1)
        ((=number? m1 0) 0)
        ((<span class="org-keyword">and</span> (number? m1) (number? m2)) (/ m1 m2))
        (<span class="org-keyword">else</span> (list '/ m1 m2))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">[u^n]' == u'*(n*u^(n-1))</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">expr == (expt u n)</span>
(<span class="org-keyword">define</span> (<span class="org-function-name">deriv-expt</span> expr var)
  (<span class="org-keyword">let</span> ((v (derivative (cadr expr) var)))
    (<span class="org-keyword">if</span> (=number? v 0)
        0
        `(* ,v (* n (expt ,(cadr expr) (- ,(caddr expr) 1)))))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">[sqrt(u)]' == u'/(2*sqrt(u))</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">expr == (sqrt 2)</span>
(<span class="org-keyword">define</span> (<span class="org-function-name">deriv-sqrt</span> expr var)
  (<span class="org-keyword">let</span> ((v (derivative (cadr expr) var)))
    (<span class="org-keyword">if</span> (=number? v 0)
        0
        `(/ ,v (* 2 (sqrt ,(cadr expr)))))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">[exp(u)]' == u'exp(u)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">expr == (exp u)</span>
(<span class="org-keyword">define</span> (<span class="org-function-name">deriv-exp</span> expr var)
  (<span class="org-keyword">let</span> ((v (derivative (cadr expr) var)))
    (<span class="org-keyword">if</span> (=number? v 0)
        0
        `(* ,v (exp ,(cadr expr))))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">[log(u)]' == u'/log(u)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">expr == (log u)</span>
(<span class="org-keyword">define</span> (<span class="org-function-name">deriv-log</span> expr var)
  (<span class="org-keyword">let</span> ((v (derivative (cadr expr) var)))
    (<span class="org-keyword">if</span> (=number? v 0)
        0
        `(/ ,v ,(cadr expr)))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">[cos(u)]' == u'cos(u)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">expr == (cos u)</span>
(<span class="org-keyword">define</span> (<span class="org-function-name">deriv-sin</span> expr var)
  (<span class="org-keyword">let</span> ((v (derivative (cadr expr) var)))
    (<span class="org-keyword">cond</span> ((=number? v 0) 0)
          ((=number? v 1) `(cos ,(cadr expr)))
          (<span class="org-keyword">else</span> `(* ,v (cos ,(cadr expr)))))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">[sin(u)]' == -u'sin(u)</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">expr == (sin u)</span>
(<span class="org-keyword">define</span> (<span class="org-function-name">deriv-cos</span> expr var)
  (<span class="org-keyword">let</span> ((v (derivative (cadr expr) var)))
    (<span class="org-keyword">cond</span> ((=number? v 0) 0)
          ((=number? v 1) `(- (sin ,(cadr expr))))
          (<span class="org-keyword">else</span> `(* ,v (- (sin ,(cadr expr))))))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Entry point</span>
(<span class="org-keyword">define</span> (<span class="org-function-name">derivative</span> expr var)
  (<span class="org-keyword">cond</span> ((number? expr) 0)
        ((variable? expr) (<span class="org-keyword">if</span> (same-variable? expr var) 1 0))
        ((sum? expr) (make-sum (derivative (addend expr) var)
                               (derivative (augend expr) var)))
        ((sub? expr) (make-sub (derivative (addend expr) var)
                               (derivative (augend expr) var)))
        ((product? expr)
         (make-sum
          (make-product (multiplier expr)
                        (derivative (multiplicand expr) var))
          (make-product (derivative (multiplier expr) var)
                        (multiplicand expr))))
        ((quotient? expr)
         (make-quotient
          (make-sub
           (make-product (derivative (multiplier expr) var)
                         (multiplicand expr))

           (make-product (multiplier expr)
                         (derivative (multiplicand expr) var)))
          (make-product
           (multiplicand expr)
           (multiplicand expr))))
        ((func? 'expt expr) (deriv-expt expr var))
        ((func? 'sqrt expr) (deriv-sqrt expr var))
        ((func? 'exp expr) (deriv-exp expr var))
        ((func? 'log expr) (deriv-log expr var))
        ((func? 'sin expr) (deriv-sin expr var))
        ((func? 'cos expr) (deriv-cos expr var))
        (<span class="org-keyword">else</span>
         (error <span class="org-string">"unknown expression type: DERIV"</span> expr))))
</pre>
</div>
</div>
</div>
