byoasp.org
** Unit Tests
#+NAME: src-differentiation-unittests
#+BEGIN_SRC scheme
  (use-modules (srfi srfi-64))
  (test-begin "differentiation-test")

  ;;;; Basic cases
  (test-equal (derivative '10 'x) 0)
  (test-equal (derivative 'x 'y) 0)
  (test-equal (derivative 'x 'x) 1)
  (test-equal (derivative '(+ 10 x) 'x) 1)
  (test-equal (derivative '(- 12 x) 'x) -1)
  (test-equal (derivative '(* x 30) 'x) 30)
  (test-equal (derivative '(/ 1 0) 'x) +inf.0)
  (test-equal (derivative '(/ 99 x) 'x) '(/ -99 (* x x)))

  ;;;; Function cases
  (test-equal (derivative '(expt (* 2 x) n) 'x)
              '(* 2 (* n (expt (* 2 x) (- n 1)))))
  (test-equal (derivative '(sqrt (* 2 x)) 'x) '(/ 2 (* 2 (sqrt (* 2 x)))))
  (test-equal (derivative '(exp (* 2 x)) 'x) '(* 2 (exp (* 2 x))))
  (test-equal (derivative '(log (* 2 x)) 'x) '(/ 2 (* 2 x)))
  (test-equal (derivative '(sin (* 2 y)) 'y) '(* 2 (cos (* 2 y))))
  (test-equal (derivative '(cos (* 2 y)) 'y) '(* 2 (- (sin (* 2 y)))))

  ;;;; More cases
  (test-equal (derivative '(* x y) 'x) 'y)
  (test-equal (derivative '(* (* x y) (+ x 3)) 'x) '(+ (* x y) (* y (+ x 3))))
  (test-equal (derivative '(sin (/ (sqrt (+ (exp x) a)) 2)) 'x)
              '(* (/ (* (/ (* 1 (exp x)) (* 2 (sqrt (+ (exp x) a)))) 2) 4)
                  (cos (/ (sqrt (+ (exp x) a)) 2))))
  (test-equal (derivative '(- (cos theta) (sin theta)) 'theta)
              '(- (- (sin theta)) (cos theta)))

  ;;;; Value cases
  (test-approximate ((lambda (x) (- (- (sin x)) (cos x))) 10)
                    1.383092639965822
                    0.001)
  (test-approximate ((eval `(lambda (x) ,(derivative '(* x (cos x)) 'x))
                           (interaction-environment)) 10)
                    4.601139579817245
                    0.001)

  ;;;; Newton cases
  (test-approximate (root-newton
                     '(- (cos theta) (sin theta)) 'theta 0.5 1e-8)
                    .7853981633974484
                    0.001)

  ;;;; Taylor cases
  (test-equal (taylor-s 5 '(exp a) 'a 'x)
              '(+ (Rn x)
                  (exp a)
                  (* (/ (* 1 (exp a)) 1) (expt (- x a) 1))
                  (* (/ (* 1 (exp a)) 2) (expt (- x a) 2))
                  (* (/ (* 1 (exp a)) 6) (expt (- x a) 3))
                  (* (/ (* 1 (exp a)) 24) (expt (- x a) 4))
                  (* (/ (* 1 (exp a)) 120) (expt (- x a) 5))))
  (test-approximate
   (let* ((Rn (lambda (x) 0))
          (taylor-fx
           (lambda (a)
             (lambda (x)
               (+ (Rn x)
                  (exp a)
                  (* (/ (* 1 (exp a)) 1) (expt (- x a) 1))
                  (* (/ (* 1 (exp a)) 2) (expt (- x a) 2))
                  (* (/ (* 1 (exp a)) 6) (expt (- x a) 3))
                  (* (/ (* 1 (exp a)) 24) (expt (- x a) 4))
                  (* (/ (* 1 (exp a)) 120) (expt (- x a) 5)))))))
     ((taylor-fx 10) 20)) 32547774.289459392 0.001)
  (test-approximate (let ((a 2)
                          (x 3)
                          (Rn (lambda (x) 0)))
                      (+ (Rn x)
                         (exp a)
                         (* (/ (* 1 (exp a)) 1) (expt (- x a) 1))
                         (* (/ (* 1 (exp a)) 2) (expt (- x a) 2))
                         (* (/ (* 1 (exp a)) 6) (expt (- x a) 3))
                         (* (/ (* 1 (exp a)) 24) (expt (- x a) 4))
                         (* (/ (* 1 (exp a)) 120) (expt (- x a) 5))))
                    20.073602402094934
                    0.001)

  (test-end "differentiation-test")
#+END_SRC
** References
- Wikipedia Team. 2023. [[https://en.wikipedia.org/wiki/Newton%27s_method][Newton's Method]]
- Wikipedia Team. 2023. [[https://en.wikipedia.org/wiki/Taylor_series][Taylor Series]]
** Full Code :noexport:
#+BEGIN_SRC scheme :mkdirp yes :exports none :tangle ./export/code/differentiation.scm :noweb yes
  <<src-differentiation-definition>>
  <<src-newton-method-definition>>
  <<src-newton-method-example>>
  <<src-taylor-series-definition>>
  <<src-taylor-series-example>>
  <<src-differentiation-unittests>>
#+END_SRC
* The Art of the Propagation, Constraint-based Systems
Design a program based on autonomous machines networks.
** Linear Equation
The following equation $3x = 2 + y$ is represented as
#+BEGIN_EXAMPLE
       
3     W                      Z     2
            *  U        U  +       
      X                      Y    
       
#+END_EXAMPLE

#+NAME: src-linear-equation-definition
#+BEGIN_SRC scheme
  (define (equation-simple x y)
    (let ((u (make-connector))
          (w (make-connector))
          (z (make-connector)))
      (multiplier w x u)
      (adder z y u)
      (constant 3 w)
      (constant 2 z)
      'ok))
#+END_SRC

#+NAME: src-linear-equation-example
#+BEGIN_SRC scheme
  (let ((X (make-connector))
        (Y (make-connector)))
    (equation-simple X Y)
    (set-value! X 25 'user)
    ;; y variable is automagically computed
    (get-value Y)
    ;; 73
    ;; Reset
    (forget-value! X 'user)
    (set-value! Y 212 'user)
    ;; x variable is automagically computed
    (get-value X)
    ;; 214/3
    )
#+END_SRC
