doc/byoasp.html
<div id="outline-container-orge050c1a" class="outline-3">
<h3 id="orge050c1a">Unit Tests</h3>
<div class="outline-text-3" id="text-orge050c1a">
<div class="org-src-container">
<pre class="src src-scheme" id="orge1e2ba1">(use-modules (srfi srfi-64))
(test-begin <span class="org-string">"differentiation-test"</span>)

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">Basic cases</span>
(test-equal (derivative '10 'x) 0)
(test-equal (derivative 'x 'y) 0)
(test-equal (derivative 'x 'x) 1)
(test-equal (derivative '(+ 10 x) 'x) 1)
(test-equal (derivative '(- 12 x) 'x) -1)
(test-equal (derivative '(* x 30) 'x) 30)
(test-equal (derivative '(/ 1 0) 'x) +inf.0)
(test-equal (derivative '(/ 99 x) 'x) '(/ -99 (* x x)))

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">Function cases</span>
(test-equal (derivative '(expt (* 2 x) n) 'x)
            '(* 2 (* n (expt (* 2 x) (- n 1)))))
(test-equal (derivative '(sqrt (* 2 x)) 'x) '(/ 2 (* 2 (sqrt (* 2 x)))))
(test-equal (derivative '(exp (* 2 x)) 'x) '(* 2 (exp (* 2 x))))
(test-equal (derivative '(log (* 2 x)) 'x) '(/ 2 (* 2 x)))
(test-equal (derivative '(sin (* 2 y)) 'y) '(* 2 (cos (* 2 y))))
(test-equal (derivative '(cos (* 2 y)) 'y) '(* 2 (- (sin (* 2 y)))))

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">More cases</span>
(test-equal (derivative '(* x y) 'x) 'y)
(test-equal (derivative '(* (* x y) (+ x 3)) 'x) '(+ (* x y) (* y (+ x 3))))
(test-equal (derivative '(sin (/ (sqrt (+ (exp x) a)) 2)) 'x)
            '(* (/ (* (/ (* 1 (exp x)) (* 2 (sqrt (+ (exp x) a)))) 2) 4)
                (cos (/ (sqrt (+ (exp x) a)) 2))))
(test-equal (derivative '(- (cos theta) (sin theta)) 'theta)
            '(- (- (sin theta)) (cos theta)))

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">Value cases</span>
(test-approximate ((<span class="org-keyword">lambda</span> (x) (- (- (sin x)) (cos x))) 10)
                  1.383092639965822
                  0.001)
(test-approximate ((eval `(<span class="org-keyword">lambda</span> (x) ,(derivative '(* x (cos x)) 'x))
                         (interaction-environment)) 10)
                  4.601139579817245
                  0.001)

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">Newton cases</span>
(test-approximate (root-newton
                   '(- (cos theta) (sin theta)) 'theta 0.5 1e-8)
                  .7853981633974484
                  0.001)

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">Taylor cases</span>
(test-equal (taylor-s 5 '(exp a) 'a 'x)
            '(+ (Rn x)
                (exp a)
                (* (/ (* 1 (exp a)) 1) (expt (- x a) 1))
                (* (/ (* 1 (exp a)) 2) (expt (- x a) 2))
                (* (/ (* 1 (exp a)) 6) (expt (- x a) 3))
                (* (/ (* 1 (exp a)) 24) (expt (- x a) 4))
                (* (/ (* 1 (exp a)) 120) (expt (- x a) 5))))
(test-approximate
 (<span class="org-keyword">let*</span> ((Rn (<span class="org-keyword">lambda</span> (x) 0))
        (taylor-fx
         (<span class="org-keyword">lambda</span> (a)
           (<span class="org-keyword">lambda</span> (x)
             (+ (Rn x)
                (exp a)
                (* (/ (* 1 (exp a)) 1) (expt (- x a) 1))
                (* (/ (* 1 (exp a)) 2) (expt (- x a) 2))
                (* (/ (* 1 (exp a)) 6) (expt (- x a) 3))
                (* (/ (* 1 (exp a)) 24) (expt (- x a) 4))
                (* (/ (* 1 (exp a)) 120) (expt (- x a) 5)))))))
   ((taylor-fx 10) 20)) 32547774.289459392 0.001)
(test-approximate (<span class="org-keyword">let</span> ((a 2)
                        (x 3)
                        (Rn (<span class="org-keyword">lambda</span> (x) 0)))
                    (+ (Rn x)
                       (exp a)
                       (* (/ (* 1 (exp a)) 1) (expt (- x a) 1))
                       (* (/ (* 1 (exp a)) 2) (expt (- x a) 2))
                       (* (/ (* 1 (exp a)) 6) (expt (- x a) 3))
                       (* (/ (* 1 (exp a)) 24) (expt (- x a) 4))
                       (* (/ (* 1 (exp a)) 120) (expt (- x a) 5))))
                  20.073602402094934
                  0.001)

(test-end <span class="org-string">"differentiation-test"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1666117" class="outline-3">
<h3 id="org1666117">References</h3>
<div class="outline-text-3" id="text-org1666117">
<ul class="org-ul">
<li>Wikipedia Team. 2023. <a href="https://en.wikipedia.org/wiki/Newton%27s_method">Newton's Method</a></li>
<li>Wikipedia Team. 2023. <a href="https://en.wikipedia.org/wiki/Taylor_series">Taylor Series</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org985e120" class="outline-2">
<h2 id="org985e120">The Art of the Propagation, Constraint-based Systems</h2>
<div class="outline-text-2" id="text-org985e120">
<p>
Design a program based on autonomous machines networks.
</p>
</div>
<div id="outline-container-orgfc3ceef" class="outline-3">
<h3 id="orgfc3ceef">Linear Equation</h3>
<div class="outline-text-3" id="text-orgfc3ceef">
<p>
The following equation \(3x = 2 + y\) is represented as
</p>
<pre class="example" id="orgaea9db1">
     ┌───────────────┐  ┌───────────────┐
3 ───┤    W          │  │          Z    ├─── 2
     │       *  U    ├──┤    U  +       │
  ───┤    X          │  │          Y    ├───
     └───────────────┘  └───────────────┘
</pre>

<div class="org-src-container">
<pre class="src src-scheme" id="org638b8db">(<span class="org-keyword">define</span> (<span class="org-function-name">equation-simple</span> x y)
  (<span class="org-keyword">let</span> ((u (make-connector))
        (w (make-connector))
        (z (make-connector)))
    (multiplier w x u)
    (adder z y u)
    (constant 3 w)
    (constant 2 z)
    'ok))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme" id="org190222f">(<span class="org-keyword">let</span> ((X (make-connector))
      (Y (make-connector)))
  (equation-simple X Y)
  (set-value! X 25 'user)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">y variable is automagically computed</span>
  (get-value Y)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">73</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Reset</span>
  (forget-value! X 'user)
  (set-value! Y 212 'user)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">x variable is automagically computed</span>
  (get-value X)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">214/3</span>
  )
</pre>
</div>
</div>
</div>
