byoasp.org
** Bernoulli Equation
Can be useful to model a root (free) beer blueprints
(see [[https://www.khanacademy.org/science/physics/fluids/fluid-dynamics/a/what-is-bernoullis-equation][What is Bernoulli's equation?]]).

The formula is
\begin{align*}
P_{1} + \frac{1}{2} \rho v_{1}^{2} + \rho g h_{1} = P_{2} + \frac{1}{2} \rho v_{2}^{2} + \rho g h_{2}
\end{align*}

And the system of propagation is
#+BEGIN_EXAMPLE
                       
                                                                             
                                           
                           c6                     P1                
                                 +  c7       c7  +                    
                           c4                     c8     
                                                     
                                                                                       
                                                                  
                                                 
                                                                                         
                       
1/2     c1                     c4         g                     c6            
              *  c3       c3  *                  *  c5       c5  *               
        rho                    v1-s          rho                   h1         
                        
                                                                                         
                                                                                          
                                        
                                                                                           
                                                                                           
                                 
                                                                                         
                                                   
                         c12                    c8        
                                +  c13      c13  +                                   
                         c10                    P2                              
                                                        
                                                                                          
                                                                                      
           1/2                
                                                                           
              
          c2                     c10         g                      c12  
             *  c9       c9  *                  *  c11      c11  *     
       rho                    v2-s          rho                    h2   
                
                                                     
                                                      
             
#+END_EXAMPLE
#+NAME: src-bernoulli-equation-definition
#+BEGIN_SRC scheme
  (define (equation-bernoulli P1 rho v1-square g h1 P2 v2-square h2)
    (let ((c1 (make-connector))
          (c2 (make-connector))
          (c3 (make-connector))
          (c4 (make-connector))
          (c5 (make-connector))
          (c6 (make-connector))
          (c7 (make-connector))
          (c8 (make-connector))
          (c9 (make-connector))
          (c10 (make-connector))
          (c11 (make-connector))
          (c12 (make-connector))
          (c13 (make-connector)))
      (constant 1/2 c1)
      (constant 1/2 c2)

      (multiplier c1 rho c3)
      (multiplier v1-square c3 c4)
      (multiplier rho g c5)
      (multiplier h1 c5 c6)
      (adder c4 c6 c7)
      (adder P1 c7 c8)

      (multiplier c2 rho c9)
      (multiplier v2-square c9 c10)
      (multiplier rho g c11)
      (multiplier h2 c11 c12)
      (adder c10 c12 c13)
      ;; c8 constrains the value to the left
      (adder P2 c13 c8)
      'ok))
#+END_SRC

#+NAME: src-bernoulli-equation-example
#+BEGIN_SRC scheme
  (let ((P1 (make-connector))
        (rho (make-connector))
        (v1-square (make-connector))
        (g (make-connector))
        (h1 (make-connector))
        (P2 (make-connector))
        (v2-square (make-connector))
        (h2 (make-connector)))
    (equation-bernoulli P1 rho v1-square g h1 P2 v2-square h2)

    ;;;; Set variables
    (set-value! P1 12300 'user)
    (set-value! rho 1090 'user)
    (set-value! v1-square (* 3.0 3.0) 'user)
    (set-value! g 9.8 'user)
    (set-value! h1 0 'user)
    (set-value! v2-square (* 0.75 0.75) 'user)
    (set-value! h2 1.20 'user)

    ;; P2 variable is automagically computed
    (get-value P2)
    ;; 4080.0375

    ;;;; Reset
    (forget-value! P1 'user)
    (forget-value! rho 'user)
    (forget-value! v1-square 'user)
    (forget-value! g 'user)
    (forget-value! h1 'user)
    (forget-value! P2 'user)
    (forget-value! v2-square 'user)
    (forget-value! h2 'user)

    ;;;; Set variables
    (set-value! rho 1000 'user)
    (set-value! v1-square (* 3.56 3.56) 'user)
    (set-value! g 9.8 'user)
    (set-value! h1 0 'user)
    (set-value! P2 0 'user)
    (set-value! v2-square (* 32 32) 'user)
    (set-value! h2 9.75 'user)

    ;; P1 variable is automagically computed
    (get-value P1)
    ;; 601213.2
    )
#+END_SRC
