doc/byoasp.html
<div id="outline-container-org9b08cb3" class="outline-3">
<h3 id="org9b08cb3">Bernoulli Equation</h3>
<div class="outline-text-3" id="text-org9b08cb3">
<p>
Can be useful to model a root (free) beer blueprints
(see <a href="https://www.khanacademy.org/science/physics/fluids/fluid-dynamics/a/what-is-bernoullis-equation">What is Bernoulli's equation?</a>).
</p>

<p>
The formula is
</p>
\begin{align*}
P_{1} + \frac{1}{2} \rho v_{1}^{2} + \rho g h_{1} = P_{2} + \frac{1}{2} \rho v_{2}^{2} + \rho g h_{2}
\end{align*}

<p>
And the system of propagation is
</p>
<pre class="example" id="org1ea7d71">
                       ┌──────────────────────────────────────────────────────┐
                       │                                                      │
                       │  ┌───────────────┐  ┌───────────────┐                │
                       └──┤    c6         │  │          P1   ├───             │
                          │       +  c7   ├──┤    c7  +      │              ┌─┼─┐
                       ┌──┤    c4         │  │          c8   ├──────────────┘ │ └────────┐
                       │  └───────────────┘  └───────────────┘                │          │
                       │                                                      │          │
                       └──────────────┐                                     ┌─┼─┐      ┌─┼─┐
                                      │       ┌─────────────────────────────┘ │ └──────┘ │ └─┐
                                      │       │                               │          │   │
       ┌───────────────┐  ┌───────────┴───┐   │ ┌───────────────┐ ┌───────────┴───┐      │   │
1/2 ───┤    c1         │  │          c4   │  ─┴─┤    g          │ │          c6   │      │   │
       │       *  c3   ├──┤    c3  *      │     │       *  c5   ├─┤    c5  *      │      │   │
    ───┤    rho        │  │          v1-s │     │    rho        │ │          h1   ├───   │   │
       └────┬──────────┘  └────────────┬──┘     └─────┬─────────┘ └───────────────┘      │   │
            │                          │              │                                  │   │
            │                                         │                                  │   │
   ┌────────┴─────────────────────────────────────────┘                                  │   │
   │                                                                                     │   │
   │                                                                                     │   │
   │                  ┌────────────────────────────────────────────────────────┐         │   │
   │                  │                                                        │         │   │
   │                  │   ┌───────────────┐  ┌───────────────┐               ┌─┼─┐       │   │
   │                  └───┤    c12        │  │          c8   ├───────────────┘ │ └───────┘   │
   │                      │       +  c13  ├──┤    c13  +     │                 │             │
   │                  ┌───┤    c10        │  │          P2   ├───              │             │
   │                  │   └───────────────┘  └───────────────┘                 │             │
   │                  │                                                        │             │
   │                  │                                                      ┌─┼─┐           │
   │        1/2       └───────────────┐       ┌──────────────────────────────┘ │ └───────────┘
   │         │                        │       │                                │
   │   ┌─────┴─────────┐  ┌───────────┴───┐   │ ┌───────────────┐  ┌───────────┴───┐
   │   │    c2         │  │          c10  │   └─┤    g          │  │          c12  │
   │   │       *  c9   ├──┤    c9  *      │     │       *  c11  ├──┤    c11  *     │
   └───┤    rho        │  │          v2-s │     │    rho        │  │          h2   ├───
       └─────┬─────────┘  └───────────┬───┘     └──────┬────────┘  └───────────────┘
             │                        │                │
             │                                         │
             └─────────────────────────────────────────┘
</pre>
<div class="org-src-container">
<pre class="src src-scheme" id="org82956ab">(<span class="org-keyword">define</span> (<span class="org-function-name">equation-bernoulli</span> P1 rho v1-square g h1 P2 v2-square h2)
  (<span class="org-keyword">let</span> ((c1 (make-connector))
        (c2 (make-connector))
        (c3 (make-connector))
        (c4 (make-connector))
        (c5 (make-connector))
        (c6 (make-connector))
        (c7 (make-connector))
        (c8 (make-connector))
        (c9 (make-connector))
        (c10 (make-connector))
        (c11 (make-connector))
        (c12 (make-connector))
        (c13 (make-connector)))
    (constant 1/2 c1)
    (constant 1/2 c2)

    (multiplier c1 rho c3)
    (multiplier v1-square c3 c4)
    (multiplier rho g c5)
    (multiplier h1 c5 c6)
    (adder c4 c6 c7)
    (adder P1 c7 c8)

    (multiplier c2 rho c9)
    (multiplier v2-square c9 c10)
    (multiplier rho g c11)
    (multiplier h2 c11 c12)
    (adder c10 c12 c13)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">c8 constrains the value to the left</span>
    (adder P2 c13 c8)
    'ok))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme" id="orgeeb79ee">(<span class="org-keyword">let</span> ((P1 (make-connector))
      (rho (make-connector))
      (v1-square (make-connector))
      (g (make-connector))
      (h1 (make-connector))
      (P2 (make-connector))
      (v2-square (make-connector))
      (h2 (make-connector)))
  (equation-bernoulli P1 rho v1-square g h1 P2 v2-square h2)

  <span class="org-comment-delimiter">;;;; </span><span class="org-comment">Set variables</span>
  (set-value! P1 12300 'user)
  (set-value! rho 1090 'user)
  (set-value! v1-square (* 3.0 3.0) 'user)
  (set-value! g 9.8 'user)
  (set-value! h1 0 'user)
  (set-value! v2-square (* 0.75 0.75) 'user)
  (set-value! h2 1.20 'user)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">P2 variable is automagically computed</span>
  (get-value P2)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">4080.0375</span>

  <span class="org-comment-delimiter">;;;; </span><span class="org-comment">Reset</span>
  (forget-value! P1 'user)
  (forget-value! rho 'user)
  (forget-value! v1-square 'user)
  (forget-value! g 'user)
  (forget-value! h1 'user)
  (forget-value! P2 'user)
  (forget-value! v2-square 'user)
  (forget-value! h2 'user)

  <span class="org-comment-delimiter">;;;; </span><span class="org-comment">Set variables</span>
  (set-value! rho 1000 'user)
  (set-value! v1-square (* 3.56 3.56) 'user)
  (set-value! g 9.8 'user)
  (set-value! h1 0 'user)
  (set-value! P2 0 'user)
  (set-value! v2-square (* 32 32) 'user)
  (set-value! h2 9.75 'user)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">P1 variable is automagically computed</span>
  (get-value P1)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">601213.2</span>
  )
</pre>
</div>
</div>
</div>
