doc/byoasp.html
<div id="outline-container-orgb3f3d07" class="outline-3">
<h3 id="orgb3f3d07">Propagation Source Code</h3>
<div class="outline-text-3" id="text-orgb3f3d07">
<div class="org-src-container">
<pre class="src src-scheme" id="org18f4dbd">(<span class="org-keyword">define</span> (<span class="org-function-name">connect</span> connector new-constraint)
  ((connector 'connect) new-constraint))

(<span class="org-keyword">define</span> (<span class="org-function-name">has-value?</span> connector)
  (connector 'has-value?))

(<span class="org-keyword">define</span> (<span class="org-function-name">get-value</span> connector)
  (connector 'value))

(<span class="org-keyword">define</span> (<span class="org-function-name">set-value!</span> connector new-value informant)
  ((connector 'set-value!) new-value informant))

(<span class="org-keyword">define</span> (<span class="org-function-name">forget-value!</span> connector retractor)
  ((connector 'forget) retractor))

(<span class="org-keyword">define</span> (<span class="org-function-name">inform-about-value</span> constraint)
  (constraint 'I-have-a-value))

(<span class="org-keyword">define</span> (<span class="org-function-name">inform-about-no-value</span> constraint)
  (constraint 'I-lost-my-value))

(<span class="org-keyword">define</span> (<span class="org-function-name">constant</span> value connector)
  (<span class="org-keyword">define</span> (<span class="org-function-name">me</span> request)
    (error <span class="org-string">"Unknown request: CONSTANT"</span> request))
  (connect connector me)
  (set-value! connector value me)
  me)

(<span class="org-keyword">define</span> (<span class="org-function-name">for-each-except</span> exception procedure list)
  (<span class="org-keyword">define</span> (<span class="org-function-name">loop</span> items)
    (<span class="org-keyword">cond</span> ((null? items) 'done)
          ((eq? (car items) exception) (loop (cdr items)))
          (<span class="org-keyword">else</span> (procedure (car items))
                (loop (cdr items)))))
  (loop list))

(<span class="org-keyword">define</span> (<span class="org-function-name">adder</span> a1 a2 sum)
  (<span class="org-keyword">define</span> (<span class="org-function-name">process-new-value</span>)
    (<span class="org-keyword">cond</span> ((<span class="org-keyword">and</span> (has-value? a1) (has-value? a2))
           (set-value! sum
                       (+ (get-value a1) (get-value a2))
                       me))
          ((<span class="org-keyword">and</span> (has-value? a1) (has-value? sum))
           (set-value! a2
                       (- (get-value sum) (get-value a1))
                       me))
          ((<span class="org-keyword">and</span> (has-value? a2) (has-value? sum))
           (set-value! a1
                       (- (get-value sum) (get-value a2))
                       me))))
  (<span class="org-keyword">define</span> (<span class="org-function-name">process-forget-value</span>)
    (forget-value! sum me)
    (forget-value! a1 me)
    (forget-value! a2 me)
    (process-new-value))
  (<span class="org-keyword">define</span> (<span class="org-function-name">me</span> request)
    (<span class="org-keyword">cond</span> ((eq? request 'I-have-a-value) (process-new-value))
          ((eq? request 'I-lost-my-value) (process-forget-value))
          (<span class="org-keyword">else</span> (error <span class="org-string">"Unknown request: ADDER"</span> request))))
  (connect a1 me)
  (connect a2 me)
  (connect sum me)
  me)

(<span class="org-keyword">define</span> (<span class="org-function-name">multiplier</span> m1 m2 product)
  (<span class="org-keyword">define</span> (<span class="org-function-name">process-new-value</span>)
    (<span class="org-keyword">cond</span> ((<span class="org-keyword">or</span> (<span class="org-keyword">and</span> (has-value? m1) (= (get-value m1) 0))
               (<span class="org-keyword">and</span> (has-value? m2) (= (get-value m2) 0)))
           (set-value! product 0 me))
          ((<span class="org-keyword">and</span> (has-value? m1) (has-value? m2))
           (set-value! product
                       (* (get-value m1) (get-value m2))
                       me))
          ((<span class="org-keyword">and</span> (has-value? product) (has-value? m1))
           (set-value! m2
                       (/ (get-value product)
                          (get-value m1))
                       me))
          ((<span class="org-keyword">and</span> (has-value? product) (has-value? m2))
           (set-value! m1
                       (/ (get-value product)
                          (get-value m2))
                       me))))
  (<span class="org-keyword">define</span> (<span class="org-function-name">process-forget-value</span>)
    (forget-value! product me)
    (forget-value! m1 me)
    (forget-value! m2 me)
    (process-new-value))
  (<span class="org-keyword">define</span> (<span class="org-function-name">me</span> request)
    (<span class="org-keyword">cond</span> ((eq? request 'I-have-a-value) (process-new-value))
          ((eq? request 'I-lost-my-value) (process-forget-value))
          (<span class="org-keyword">else</span> (error <span class="org-string">"Unknown request: MULTIPLIER"</span>
                       request))))
  (connect m1 me)
  (connect m2 me)
  (connect product me)
  me)

(<span class="org-keyword">define</span> (<span class="org-function-name">make-connector</span>)
  (<span class="org-keyword">let</span> ((value #f) (informant #f) (constraints '()))
    (<span class="org-keyword">define</span> (<span class="org-function-name">set-my-value</span> newval setter)
      (<span class="org-keyword">cond</span> ((not (has-value? me))
             (set! value newval)
             (set! informant setter)
             (for-each-except setter
                              inform-about-value
                              constraints))
            ((not (= value newval))
             (error <span class="org-string">"Contradiction"</span> (list value newval)))
            (<span class="org-keyword">else</span> 'ignored)))
    (<span class="org-keyword">define</span> (<span class="org-function-name">forget-my-value</span> retractor)
      (<span class="org-keyword">if</span> (eq? retractor informant)
          (<span class="org-keyword">begin</span> (set! informant #f)
                 (for-each-except retractor
                                  inform-about-no-value
                                  constraints))
          'ignored))
    (<span class="org-keyword">define</span> (<span class="org-function-name">connect</span> new-constraint)
      (<span class="org-keyword">if</span> (not (memq new-constraint constraints))
          (set! constraints
                (cons new-constraint constraints)))
      (<span class="org-keyword">if</span> (has-value? me)
          (inform-about-value new-constraint))
      'done)
    (<span class="org-keyword">define</span> (<span class="org-function-name">me</span> request)
      (<span class="org-keyword">cond</span> ((eq? request 'has-value?)
             (<span class="org-keyword">if</span> informant #t #f))
            ((eq? request 'value) value)
            ((eq? request 'set-value!) set-my-value)
            ((eq? request 'forget) forget-my-value)
            ((eq? request 'connect) connect)
            (<span class="org-keyword">else</span> (error <span class="org-string">"Unknown operation: CONNECTOR"</span>
                         request))))
    me))
</pre>
</div>
</div>
</div>
