byoasp.org
** Unit Tests
#+NAME: src-propagation-unittests
#+BEGIN_SRC scheme
  (use-modules (srfi srfi-64))
  (test-begin "propagation-test")

  ;;;; Simple cases
  (let ((X (make-connector))
        (Y (make-connector)))
    (equation-simple X Y)
    (set-value! X 25 'user)
    ;; y variable is automagically computed
    (test-equal (get-value Y) 73)
    (forget-value! X 'user)
    (set-value! Y 212 'user)
    ;; x variable is automagically computed
    (test-equal (get-value X) 214/3))

  ;;;; Bernoulli cases
  (let ((P1 (make-connector))
        (rho (make-connector))
        (v1-square (make-connector))
        (g (make-connector))
        (h1 (make-connector))
        (P2 (make-connector))
        (v2-square (make-connector))
        (h2 (make-connector)))
    (equation-bernoulli P1 rho v1-square g h1 P2 v2-square h2)
    (set-value! P1 12300 'user)
    (set-value! rho 1090 'user)
    (set-value! v1-square (* 3.0 3.0) 'user)
    (set-value! g 9.8 'user)
    (set-value! h1 0 'user)
    (set-value! v2-square (* 0.75 0.75) 'user)
    (set-value! h2 1.20 'user)
    ;; P2 variable is automagically computed
    (test-approximate (get-value P2) 4080.0375 0.001)
    (forget-value! P1 'user)
    (forget-value! rho 'user)
    (forget-value! v1-square 'user)
    (forget-value! g 'user)
    (forget-value! h1 'user)
    (forget-value! P2 'user)
    (forget-value! v2-square 'user)
    (forget-value! h2 'user)
    (set-value! rho 1000 'user)
    (set-value! v1-square (* 3.56 3.56) 'user)
    (set-value! g 9.8 'user)
    (set-value! h1 0 'user)
    (set-value! P2 0 'user)
    (set-value! v2-square (* 32 32) 'user)
    (set-value! h2 9.75 'user)
    ;; P1 variable is automagically computed
    (test-approximate (get-value P1) 601213.2 0.001))

  (test-end "propagation-test")
#+END_SRC
** References
- Khan Academy. 2017. [[https://www.khanacademy.org/science/physics/fluids/fluid-dynamics/a/what-is-bernoullis-equation][What is Bernoulli's equation?]]
** Full Code :noexport:
#+BEGIN_SRC scheme :mkdirp yes :exports none :tangle ./export/code/propagation.scm :noweb yes
  <<src-propagation-definition>>
  <<src-linear-equation-definition>>
  <<src-linear-equation-example>>
  <<src-bernoulli-equation-definition>>
  <<src-bernoulli-equation-example>>
  <<src-propagation-unittests>>
#+END_SRC
* Amb Evaluator, Nondeterministic Computing
The famous McCarthy's Ambiguous Operator!\\
The main idea is to search using backtracking and dependencies.
** Pythagorean Triples
It consists of three positive integers, such that $a^{2} + b^{2} = c^{2}$
#+NAME: src-pythagorean-definition
#+BEGIN_SRC scheme
  (define (a-pythagorean-triple-between low high)
    (let ((i (an-integer-between low high)))
      (let ((j (an-integer-between i high)))
        (let ((k (an-integer-between j high)))
          (require (= (+ (* i i) (* j j)) (* k k)))
          (list i j k)))))
#+END_SRC

#+NAME: src-pythagorean-example
#+BEGIN_SRC scheme
  (a-pythagorean-triple-between 2 10)
  ;; (3 4 5)

  ;; Next triples
  (amb)
  ;; (6 8 10)
#+END_SRC
** Advent of Code 2022, Day 15
Part one asks for how many positions cannot contain a beacon
(see [[https://adventofcode.com/2022/day/15][Day 15]]).
#+NAME: src-beacon-definition
#+BEGIN_SRC scheme
  (define sensors-report '(((2 18) (-2 15))
                           ((9 16) (10 16))
                           ((13 2) (15 3))
                           ((12 14) (10 16))
                           ((10 20) (10 16))
                           ((14 17) (10 16))
                           ((8 7) (2 10))
                           ((2 0) (2 10))
                           ((0 11) (2 10))
                           ((20 14) (25 17))
                           ((17 20) (21 22))
                           ((16 7) (15 3))
                           ((14 3) (15 3))
                           ((20 1) (15 3))))

  (define (manhattan-distance x1 y1 x2 y2)
    (+ (abs (- x1 x2))
       (abs (- y1 y2))))

  (define (beacon-possible-require x y)
    (define (helper sr)
      (let ((sensor-x (car (car sr)))
            (sensor-y (cadr (car sr)))
            (beacon-x (car (cadr sr)))
            (beacon-y (cadr (cadr sr))))
        (require (> (manhattan-distance sensor-x
                                        sensor-y
                                        x
                                        y)
                    (manhattan-distance sensor-x
                                        sensor-y
                                        beacon-x
                                        beacon-y)))))
    helper)

  (define (beacon-possible x-low x-high y-low y-high)
    (let ((x (an-integer-between x-low x-high)))
      (let ((y (an-integer-between y-low y-high)))
        (map (beacon-possible-require x y) sensors-report)
        (list x y))))

  (define (beacon-all-nb x-low x-high y-low y-high)
    (* (+ (abs x-low) (abs x-high))
       (+ (- y-high y-low) 1)))

  (define beacon-possible-nb 0)

  (define (beacon-possible-search! x-low x-high y-low y-high)
    (set! beacon-possible-nb 0)
    (beacon-possible x-low x-high y-low y-high)
    (set! beacon-possible-nb (+ beacon-possible-nb 1))
    (amb))
#+END_SRC

#+NAME: src-beacon-impossible-example
#+BEGIN_SRC scheme
  (beacon-possible-search! -4 26 10 10)

  beacon-possible-nb
  ;; 4

  (- (beacon-all-nb -4 26 10 10) beacon-possible-nb)
  ;; 26
#+END_SRC

In part two, the goal is to find the hidden beacons.
#+NAME: src-beacon-possible-example
#+BEGIN_SRC scheme
  (beacon-possible 0 20 0 20)
  ;; (14 11)
#+END_SRC
** Amb Source Code
#+NAME: src-amb-definition
#+BEGIN_SRC scheme
  (define (*failure*) (error "Failure"))

  ;; The *magical* part (call/cc and macros)
  (define-syntax amb
    (syntax-rules ()
      ((amb) (*failure*))
      ((amb ?x) ?x)
      ((amb ?x ?y)
       (let ((old-failure *failure*))
         ((call-with-current-continuation
           (lambda (cc)
             (set! *failure*
                   (lambda ()
                     (set! *failure* old-failure)
                     (cc (lambda () ?y))))
             (lambda () ?x))))))
      ((amb ?x ?rest ...)
       (amb ?x (amb ?rest ...)))))

  (define (require p)
    (if (not p) (amb) 'ok))

  (define (an-integer-between low high)
    (require (<= low high))
    (amb low (an-integer-between (+ low 1) high)))
#+END_SRC
