doc/byoasp.html
<div id="outline-container-orge5093f8" class="outline-3">
<h3 id="orge5093f8">Unit Tests</h3>
<div class="outline-text-3" id="text-orge5093f8">
<div class="org-src-container">
<pre class="src src-scheme" id="orge312b88">(use-modules (srfi srfi-64))
(test-begin <span class="org-string">"propagation-test"</span>)

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">Simple cases</span>
(<span class="org-keyword">let</span> ((X (make-connector))
      (Y (make-connector)))
  (equation-simple X Y)
  (set-value! X 25 'user)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">y variable is automagically computed</span>
  (test-equal (get-value Y) 73)
  (forget-value! X 'user)
  (set-value! Y 212 'user)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">x variable is automagically computed</span>
  (test-equal (get-value X) 214/3))

<span class="org-comment-delimiter">;;;; </span><span class="org-comment">Bernoulli cases</span>
(<span class="org-keyword">let</span> ((P1 (make-connector))
      (rho (make-connector))
      (v1-square (make-connector))
      (g (make-connector))
      (h1 (make-connector))
      (P2 (make-connector))
      (v2-square (make-connector))
      (h2 (make-connector)))
  (equation-bernoulli P1 rho v1-square g h1 P2 v2-square h2)
  (set-value! P1 12300 'user)
  (set-value! rho 1090 'user)
  (set-value! v1-square (* 3.0 3.0) 'user)
  (set-value! g 9.8 'user)
  (set-value! h1 0 'user)
  (set-value! v2-square (* 0.75 0.75) 'user)
  (set-value! h2 1.20 'user)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">P2 variable is automagically computed</span>
  (test-approximate (get-value P2) 4080.0375 0.001)
  (forget-value! P1 'user)
  (forget-value! rho 'user)
  (forget-value! v1-square 'user)
  (forget-value! g 'user)
  (forget-value! h1 'user)
  (forget-value! P2 'user)
  (forget-value! v2-square 'user)
  (forget-value! h2 'user)
  (set-value! rho 1000 'user)
  (set-value! v1-square (* 3.56 3.56) 'user)
  (set-value! g 9.8 'user)
  (set-value! h1 0 'user)
  (set-value! P2 0 'user)
  (set-value! v2-square (* 32 32) 'user)
  (set-value! h2 9.75 'user)
  <span class="org-comment-delimiter">;; </span><span class="org-comment">P1 variable is automagically computed</span>
  (test-approximate (get-value P1) 601213.2 0.001))

(test-end <span class="org-string">"propagation-test"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6e257a0" class="outline-3">
<h3 id="org6e257a0">References</h3>
<div class="outline-text-3" id="text-org6e257a0">
<ul class="org-ul">
<li>Khan Academy. 2017. <a href="https://www.khanacademy.org/science/physics/fluids/fluid-dynamics/a/what-is-bernoullis-equation">What is Bernoulli's equation?</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org073ea1d" class="outline-2">
<h2 id="org073ea1d">Amb Evaluator, Nondeterministic Computing</h2>
<div class="outline-text-2" id="text-org073ea1d">
<p>
The famous McCarthy's Ambiguous Operator!<br />
The main idea is to search using backtracking and dependencies.
</p>
</div>
<div id="outline-container-orga09875b" class="outline-3">
<h3 id="orga09875b">Pythagorean Triples</h3>
<div class="outline-text-3" id="text-orga09875b">
<p>
It consists of three positive integers, such that \(a^{2} + b^{2} = c^{2}\)
</p>
<div class="org-src-container">
<pre class="src src-scheme" id="orgb220eec">(<span class="org-keyword">define</span> (<span class="org-function-name">a-pythagorean-triple-between</span> low high)
  (<span class="org-keyword">let</span> ((i (an-integer-between low high)))
    (<span class="org-keyword">let</span> ((j (an-integer-between i high)))
      (<span class="org-keyword">let</span> ((k (an-integer-between j high)))
        (require (= (+ (* i i) (* j j)) (* k k)))
        (list i j k)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme" id="org6b6d551">(a-pythagorean-triple-between 2 10)
<span class="org-comment-delimiter">;; </span><span class="org-comment">(3 4 5)</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Next triples</span>
(amb)
<span class="org-comment-delimiter">;; </span><span class="org-comment">(6 8 10)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0e08879" class="outline-3">
<h3 id="org0e08879">Advent of Code 2022, Day 15</h3>
<div class="outline-text-3" id="text-org0e08879">
<p>
Part one asks for how many positions cannot contain a beacon
(see <a href="https://adventofcode.com/2022/day/15">Day 15</a>).
</p>
<div class="org-src-container">
<pre class="src src-scheme" id="orgf6523e9">(<span class="org-keyword">define</span> <span class="org-function-name">sensors-report</span> '(((2 18) (-2 15))
                         ((9 16) (10 16))
                         ((13 2) (15 3))
                         ((12 14) (10 16))
                         ((10 20) (10 16))
                         ((14 17) (10 16))
                         ((8 7) (2 10))
                         ((2 0) (2 10))
                         ((0 11) (2 10))
                         ((20 14) (25 17))
                         ((17 20) (21 22))
                         ((16 7) (15 3))
                         ((14 3) (15 3))
                         ((20 1) (15 3))))

(<span class="org-keyword">define</span> (<span class="org-function-name">manhattan-distance</span> x1 y1 x2 y2)
  (+ (abs (- x1 x2))
     (abs (- y1 y2))))

(<span class="org-keyword">define</span> (<span class="org-function-name">beacon-possible-require</span> x y)
  (<span class="org-keyword">define</span> (<span class="org-function-name">helper</span> sr)
    (<span class="org-keyword">let</span> ((sensor-x (car (car sr)))
          (sensor-y (cadr (car sr)))
          (beacon-x (car (cadr sr)))
          (beacon-y (cadr (cadr sr))))
      (require (&gt; (manhattan-distance sensor-x
                                      sensor-y
                                      x
                                      y)
                  (manhattan-distance sensor-x
                                      sensor-y
                                      beacon-x
                                      beacon-y)))))
  helper)

(<span class="org-keyword">define</span> (<span class="org-function-name">beacon-possible</span> x-low x-high y-low y-high)
  (<span class="org-keyword">let</span> ((x (an-integer-between x-low x-high)))
    (<span class="org-keyword">let</span> ((y (an-integer-between y-low y-high)))
      (<span class="org-keyword">map</span> (beacon-possible-require x y) sensors-report)
      (list x y))))

(<span class="org-keyword">define</span> (<span class="org-function-name">beacon-all-nb</span> x-low x-high y-low y-high)
  (* (+ (abs x-low) (abs x-high))
     (+ (- y-high y-low) 1)))

(<span class="org-keyword">define</span> <span class="org-function-name">beacon-possible-nb</span> 0)

(<span class="org-keyword">define</span> (<span class="org-function-name">beacon-possible-search!</span> x-low x-high y-low y-high)
  (set! beacon-possible-nb 0)
  (beacon-possible x-low x-high y-low y-high)
  (set! beacon-possible-nb (+ beacon-possible-nb 1))
  (amb))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme" id="orgc8b5e7a">(beacon-possible-search! -4 26 10 10)

beacon-possible-nb
<span class="org-comment-delimiter">;; </span><span class="org-comment">4</span>

(- (beacon-all-nb -4 26 10 10) beacon-possible-nb)
<span class="org-comment-delimiter">;; </span><span class="org-comment">26</span>
</pre>
</div>

<p>
In part two, the goal is to find the hidden beacons.
</p>
<div class="org-src-container">
<pre class="src src-scheme" id="org1f7245e">(beacon-possible 0 20 0 20)
<span class="org-comment-delimiter">;; </span><span class="org-comment">(14 11)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org91a2c1f" class="outline-3">
<h3 id="org91a2c1f">Amb Source Code</h3>
<div class="outline-text-3" id="text-org91a2c1f">
<div class="org-src-container">
<pre class="src src-scheme" id="org70daa0c">(<span class="org-keyword">define</span> (<span class="org-function-name">*failure*</span>) (error <span class="org-string">"Failure"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">The *magical* part (call/cc and macros)</span>
(<span class="org-keyword">define-syntax</span> <span class="org-variable-name">amb</span>
  (<span class="org-keyword">syntax-rules</span> ()
    ((amb) (*failure*))
    ((amb ?x) ?x)
    ((amb ?x ?y)
     (<span class="org-keyword">let</span> ((old-failure *failure*))
       ((<span class="org-keyword">call-with-current-continuation</span>
         (<span class="org-keyword">lambda</span> (cc)
           (set! *failure*
                 (<span class="org-keyword">lambda</span> ()
                   (set! *failure* old-failure)
                   (cc (<span class="org-keyword">lambda</span> () ?y))))
           (<span class="org-keyword">lambda</span> () ?x))))))
    ((amb ?x ?rest ...)
     (amb ?x (amb ?rest ...)))))

(<span class="org-keyword">define</span> (<span class="org-function-name">require</span> p)
  (<span class="org-keyword">if</span> (not p) (amb) 'ok))

(<span class="org-keyword">define</span> (<span class="org-function-name">an-integer-between</span> low high)
  (require (&lt;= low high))
  (amb low (an-integer-between (+ low 1) high)))
</pre>
</div>
</div>
</div>
